rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
/*
Testing UiTM WiFi IoT 9/12/2022 Friday
Works with ESP32S2
Edited 28 Dec 2022
Subscribed to Blynk Plus RM30.90/month on Monday 13 Feb 2023
Connected and Disconnected logic furnished 15 Feb 2023

solving MD5 flash issue Sunday 18 June 2023 at TBS
python3 -m esptool --chip esp32 write_flash_status --non-volatile 0
python3 -m esptool --chip esp32 erase_flash 

need to limit INA219 readout from ESPNOW to 2 decimal places 28 June 2023
change the struct on both server and client
*/
// #define ESP32S2_1  // M01
// #define ESP32S2_2  // M02
// #define ESP32S2_3  // M03
// #define ESP32S2_4  // M04
#define ESP32S2_5  // M05
// #define ESP32S2_6  // M06
// #define ESP32DEV_1 // M07 control water valve & pump
// #define ESP32DEV_2 // M08 @ water level sensing
// #define ESP32DEV_3
// #define ESP32DEV_4 // DEV_4 NEW TBS front gate (perfect DEV)
// #define ESP32DEV_5 // M10
// #define ESP32DEV_6 // TBS front gate (perfect DEV)
// #define ESP32DEV_0 // DEV_0 NEW TBS front gate (perfect DEV)
// #define ESP32C3_4

// #define REGULAR_I2C_LCD // comment if using GROVE_LCD
#define LOCATION_MKE2_UiTM_WiFi_IoT // comment this line for TBS deployment
// #define LOCATION_MKE2_MaxisONE // comment this line for MaxisONE Fibre 2.4G_EXT
// #define Maxis_Postpaid_128

/*
V1 dateTime
V2 WiFi.localIP().toString()
V3 restart_ts & deep sleep info
V4 RSSI_dBm
V5 restartCounter
V6 busvoltage
V7 current_mA
V8 ssid
V9 get_rssi_state(RSSI_dBm)
V10 tempC
V11 humid
V12 json weather & jsonstring espnow
V13 not use
V14 not use
V15 disconn_ts_str & jsonstring espnow
V16 disconnection_count
V17 blynk_on_connected_ts
V18 ads_readout & water level
V19 wifiRetryCount
V20 BLYNK_WRITE R
V21 BLYNK_WRITE G
V22 BLYNK_WRITE B
V23 BLYNK_WRITE Clear RC
V24 BLYNK_WRITE Relay 1
V25 BLYNK_WRITE Relay 2
V26 BLYNK_WRITE Relay 3
V27 BLYNK_WRITE clear_disconnCounter
V28 BLYNK_WRITE clearWiFiRetry + espnow on/off
V29 default_hostname

V30 not use (going to be get_ambient_temp) GAUGE
V31 not use waterlevel GAUGE
V32 not use espnow c3-4 volt GAUGE
V33 not use espnow c3-7 volt GAUGE
V34 get_ambient_temp ----> espnow c3-4 amp GAUGE
V35 not use espnow c3-7 amp GAUGE
V36 not use espnow c3-4 moisture GAUGE
V37 not use espnow c3-7 moisture GAUGE
V38 not use espnow c3-4 soil temp GAUGE
V39 not use espnow c3-7 soil temp GAUGE

V40 Button LED Backlight
V41 Button Deep Sleep
V42 Button Display espnow
*/

bool deep_sleep_activated = false;
// deep sleep config
#define uS_TO_S_FACTOR 1000000ULL  /* Conversion factor for micro seconds to seconds */
#define SLEEP_HOUR     13
#define TIME_TO_SLEEP  SLEEP_HOUR*3600       /* Time ESP32 will go to sleep (in seconds) 50400 */
#define WAKEUP_HOUR    6
int setSleepHour = 18;
int setSleepMin = 0;
uint8_t etaHour = 0;
uint8_t etaMin = 0;
uint8_t etaSec = 0;
String etaDS = "HH:MM:SS";
RTC_DATA_ATTR int bootCount = 0;

int elapseEntry = 0;
int elapseExit = 0;
int elapseSec = 0;
int e_h, e_m, e_s;
String e_HourStr, e_MinStr, e_SecStr;
String e_elapse;

/* Comment this out to disable prints and save space */
#define BLYNK_PRINT Serial
#define BLYNK_TEMPLATE_ID   "TMPLjsD8y_SC" // template ID for M04 and M05 then subcribing to Plus RM30.90 13Feb2023
#define BLYNK_TEMPLATE_NAME "AASAS UiTM WiFi IoT"

#if defined ESP32S2_1
  #define BLYNK_DEVICE_NAME "AASAS M01"
  #define BLYNK_AUTH_TOKEN "J3DXwnJNxoCIUI3TF7ULHmCKdDg27FV4"
#elif defined ESP32S2_2
  #define BLYNK_DEVICE_NAME "AASAS M02"
  #define BLYNK_AUTH_TOKEN "AgRl8rHXRFkz4KnUvFWfQtlUCGZ6g8ug"
#elif defined ESP32S2_3
  #define BLYNK_DEVICE_NAME "AASAS M03"
  #define BLYNK_AUTH_TOKEN "vdnuDWozgCa3oP3_xXnekRTLmlo2mjuk"
#elif defined ESP32S2_4 || defined ESP32DEV_4 || defined ESP32DEV_6
  #define BLYNK_DEVICE_NAME "AASAS M04"
  #define BLYNK_AUTH_TOKEN "gee5lkJxSCmQrqplsAiH-uVPuNkF-B3G"
#elif defined ESP32S2_5 || defined ESP32DEV_2
  #define BLYNK_DEVICE_NAME "IFTTT M05"
  #define BLYNK_AUTH_TOKEN "Rq548So3QmWpZIJyAt59TVmW8W4GGlUd"
#elif defined ESP32S2_6
  #define BLYNK_DEVICE_NAME "AASAS M06"
  #define BLYNK_AUTH_TOKEN "qtER7nxNJH1QioLqmH_rE688VdJ5i0L0"
#elif defined ESP32DEV_1
  #define BLYNK_DEVICE_NAME "AASAS M07"
  #define BLYNK_AUTH_TOKEN "K-NDkXmOkZNC3TIKZo6EOrqdQQ8-Mr_f"
#elif defined ESP32DEV_2XXX
  #define BLYNK_DEVICE_NAME "AASAS M08"
  #define BLYNK_AUTH_TOKEN "VoVZgVSmyKThZyh8KSS9oNq7gEcPLk0b"
#elif defined ESP32DEV_5
  #define BLYNK_DEVICE_NAME "AASAS M10"
  #define BLYNK_AUTH_TOKEN "Wo6dEX9FFGRjR-fbRShY-FxM9uYAYdqp"
#elif defined ESP32DEV_0// ESP32DEV_4 NEW
  #define BLYNK_DEVICE_NAME "AASAS M09" 
  #define BLYNK_AUTH_TOKEN "ZELuVGWY16O3KPW8mLkgkdISj2ohVgP7"
#endif

#include "GroveBase-ESPDuino32-Mapping.h"
#include <esp_now.h>
#include <Wire.h>
#include<ADS1115_WE.h> 
#include "rgb_lcd.h"
#include <LiquidCrystal_I2C.h>

#include <WiFi.h>
#include <WiFiClient.h>
#include <BlynkSimpleEsp32.h>
#include "uptime_formatter.h"
#include "uptime.h"
#include "EEPROM.h"

#include <Adafruit_NeoPixel.h>
#include <Adafruit_INA219.h>

#include <NTPClient.h>
#include <WiFiUdp.h>
#include <HTTPClient.h>
#include <Arduino_JSON.h>
#include "DS1307.h"
#include <ChainableLED.h>

#include "WiFiClientSecure.h"
#include "Adafruit_MQTT.h"
#include "Adafruit_MQTT_Client.h"

#define AIO_SERVER      "io.adafruit.com"
// Using port 8883 for MQTTS
#define AIO_SERVERPORT  8883                  
#define AIO_USERNAME    "clumzyazid"
// #define AIO_KEY         "aio_VGkW373G4psoR4xzLlG4WvOsmvue" // disabled 15 Nov after GitHub leaked
#define AIO_KEY         "aio_kDjS914Yqk7rDbXUt5s1f2gWjngx" // new key obtained 16 Nov 2023

String entryStatus = "None";

WiFiClientSecure client;

Adafruit_MQTT_Client mqtt(&client, AIO_SERVER, AIO_SERVERPORT, AIO_USERNAME, AIO_KEY);    

// io.adafruit.com root CA
const char* adafruitio_root_ca = \
      "-----BEGIN CERTIFICATE-----\n"
      "MIIEjTCCA3WgAwIBAgIQDQd4KhM/xvmlcpbhMf/ReTANBgkqhkiG9w0BAQsFADBh\n"
      "MQswCQYDVQQGEwJVUzEVMBMGA1UEChMMRGlnaUNlcnQgSW5jMRkwFwYDVQQLExB3\n"
      "d3cuZGlnaWNlcnQuY29tMSAwHgYDVQQDExdEaWdpQ2VydCBHbG9iYWwgUm9vdCBH\n"
      "MjAeFw0xNzExMDIxMjIzMzdaFw0yNzExMDIxMjIzMzdaMGAxCzAJBgNVBAYTAlVT\n"
      "MRUwEwYDVQQKEwxEaWdpQ2VydCBJbmMxGTAXBgNVBAsTEHd3dy5kaWdpY2VydC5j\n"
      "b20xHzAdBgNVBAMTFkdlb1RydXN0IFRMUyBSU0EgQ0EgRzEwggEiMA0GCSqGSIb3\n"
      "DQEBAQUAA4IBDwAwggEKAoIBAQC+F+jsvikKy/65LWEx/TMkCDIuWegh1Ngwvm4Q\n"
      "yISgP7oU5d79eoySG3vOhC3w/3jEMuipoH1fBtp7m0tTpsYbAhch4XA7rfuD6whU\n"
      "gajeErLVxoiWMPkC/DnUvbgi74BJmdBiuGHQSd7LwsuXpTEGG9fYXcbTVN5SATYq\n"
      "DfbexbYxTMwVJWoVb6lrBEgM3gBBqiiAiy800xu1Nq07JdCIQkBsNpFtZbIZhsDS\n"
      "fzlGWP4wEmBQ3O67c+ZXkFr2DcrXBEtHam80Gp2SNhou2U5U7UesDL/xgLK6/0d7\n"
      "6TnEVMSUVJkZ8VeZr+IUIlvoLrtjLbqugb0T3OYXW+CQU0kBAgMBAAGjggFAMIIB\n"
      "PDAdBgNVHQ4EFgQUlE/UXYvkpOKmgP792PkA76O+AlcwHwYDVR0jBBgwFoAUTiJU\n"
      "IBiV5uNu5g/6+rkS7QYXjzkwDgYDVR0PAQH/BAQDAgGGMB0GA1UdJQQWMBQGCCsG\n"
      "AQUFBwMBBggrBgEFBQcDAjASBgNVHRMBAf8ECDAGAQH/AgEAMDQGCCsGAQUFBwEB\n"
      "BCgwJjAkBggrBgEFBQcwAYYYaHR0cDovL29jc3AuZGlnaWNlcnQuY29tMEIGA1Ud\n"
      "HwQ7MDkwN6A1oDOGMWh0dHA6Ly9jcmwzLmRpZ2ljZXJ0LmNvbS9EaWdpQ2VydEds\n"
      "b2JhbFJvb3RHMi5jcmwwPQYDVR0gBDYwNDAyBgRVHSAAMCowKAYIKwYBBQUHAgEW\n"
      "HGh0dHBzOi8vd3d3LmRpZ2ljZXJ0LmNvbS9DUFMwDQYJKoZIhvcNAQELBQADggEB\n"
      "AIIcBDqC6cWpyGUSXAjjAcYwsK4iiGF7KweG97i1RJz1kwZhRoo6orU1JtBYnjzB\n"
      "c4+/sXmnHJk3mlPyL1xuIAt9sMeC7+vreRIF5wFBC0MCN5sbHwhNN1JzKbifNeP5\n"
      "ozpZdQFmkCo+neBiKR6HqIA+LMTMCMMuv2khGGuPHmtDze4GmEGZtYLyF8EQpa5Y\n"
      "jPuV6k2Cr/N3XxFpT3hRpt/3usU/Zb9wfKPtWpoznZ4/44c1p9rzFcZYrWkj3A+7\n"
      "TNBJE0GmP2fhXhP1D/XVfIW/h0yCJGEiV9Glm/uGOa3DXHlmbAcxSyCRraG+ZBkA\n"
      "7h4SeM6Y8l/7MBRpPCz6l8Y=\n"
      "-----END CERTIFICATE-----\n";

