rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
Adafruit_MQTT_Subscribe ESP32S2_RGB_SW = Adafruit_MQTT_Subscribe(&mqtt, AIO_USERNAME "/feeds/ResetFeed");
Adafruit_MQTT_Subscribe locationTracker = Adafruit_MQTT_Subscribe(&mqtt, AIO_USERNAME "/feeds/LocationAwareness"); // added 8 Nov 2023 Wednesday

// Setup a feed called 'test' for publishing.
// Notice MQTT paths for AIO follow the form: <username>/feeds/<feedname>
Adafruit_MQTT_Publish pubTracker = Adafruit_MQTT_Publish(&mqtt, AIO_USERNAME "/feeds/TOGGLE");

void MQTT_connect();


TaskHandle_t Task1; // ESPNOW
TaskHandle_t Task2; // BLYNK

// MAC Address of the receiver #1 => 9c:9c:1f:c5:94:24 (ESP01-client-1)
uint8_t client1_mac[] = {0x9C, 0x9C, 0x1F, 0xC5, 0x94, 0x24};
String client1_mac_string = "9c:9c:1f:c5:94:24"; // must be lowercase 27.08.2022 Sat
const char* client1_cchar = client1_mac_string.c_str();

// MAC Address of the receiver #2 => 9c:9c:1f:e3:85:3c (ESP01-client-2)
uint8_t client2_mac[] = {0x9C, 0x9C, 0x1F, 0xE3, 0x85, 0x3C};
String client2_mac_string = "9c:9c:1f:e3:85:3c"; // must be lowercase 27.08.2022 Sat
const char* client2_cchar = client2_mac_string.c_str();

// MAC Address of the receiver #3  7C:DF:A1:AF:AA:B4 (ESP32-C3 26.08.2022)
// 7C:DF:A1:AF:AB:00 (changed 9 June 2023 after crosscheck)
uint8_t client3_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xAB, 0x00};
String client3_mac_string = "7c:df:a1:af:ab:00"; // must be lowercase 27.08.2022 Sat
const char* client3_cchar = client3_mac_string.c_str();

// 7C:DF:A1:AF:AD:24 (C3-4) added 10.06.2023 saturday after SKJMT IBIZ
uint8_t client4_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xAD, 0x24};
String client4_mac_string = "7c:df:a1:af:ad:24"; // new C3-74 added 9.june.2023
const char* client4_cchar = client4_mac_string.c_str();

// 7C:DF:A1:AF:AC:B8 (C3-6)
uint8_t client6_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xAC, 0xB8}; // MAC not confirmed 10.june.2023
String client6_mac_string = "7c:df:a1:af:ac:b8"; // MAC not confirmed 10.june.2023
const char* client6_cchar = client6_mac_string.c_str(); // changed 10.june.2023 after SKJMT


// 7C:DF:A1:AF:A8:D8(C3-7)
uint8_t client7_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xA8, 0xD8}; // MAC not confirmed 10.june.2023
String client7_mac_string = "7c:df:a1:af:a8:d8"; // MAC not confirmed 10.june.2023
const char* client7_cchar = client7_mac_string.c_str(); // changed 10.june.2023 after SKJMT


//7C:DF:A1:AF:AD:20 (C3-8)
uint8_t client8_mac[] = {0x7C, 0xDF, 0xA1, 0xAF, 0xAD, 0x20}; // changed 10.june.2023 after SKJMT
String client8_mac_string = "7c:df:a1:af:ad:20"; // new C3-7 added 9.june.2023
const char* client8_cchar = client8_mac_string.c_str(); // changed 10.june.2023 after SKJMT

//48:27:E2:5D:C5:1C (S2m1)
uint8_t client9_mac[] = {0x48, 0x27, 0xE2, 0x5D, 0xC5, 0x1C}; // changed 10.june.2023 after SKJMT
String client9_mac_string = "48:27:e2:5d:c5:1c"; // added S2m1 26 June 2023 after condemning ESP32C3-3
const char* client9_cchar = client9_mac_string.c_str(); // changed 10.june.2023 after SKJMT


// Structure example to receive data
// Must EXACTLY MATCH THE PATTERN of the sender's structure
typedef struct struct_message {
  String id;
  unsigned int readingId;
  float volt;
  float amps;
  float temp;
  float humi;
  float mois;
  float rain;
} struct_message;

struct_message incomingReadings;

//Structure example to send data
//Must match the receiver structure (client-1 and client-2)
typedef struct struct_control {
    int control;
} struct_control;


//Create a struct_message called sendControl
struct_control sendControl;
JSONVar     board;

bool esp_now_initialized = false;
#define CORE_0      0x00
#define CORE_1      0x01

bool displayESPNOW = false;
String jsonString1 = "None";
String dt1 = "None";
float temp1 = 0;
float humi1 = 0;
float moist1 = 0;
float rain1 = 0;
float volt1 = 0;
float amps1 = 0;
uint16_t read_id1 = 0;
uint16_t prev_read_id1 = 0;

String jsonString2 = "None";
String dt2 = "None";
float temp2 = 0;
float humi2 = 0;
float moist2 = 0;
float rain2 = 0;
float volt2 = 0;
float amps2 = 0;
uint16_t read_id2 = 0;
uint16_t prev_read_id2 = 0;

String jsonString3 = "None";
String dt3 = "None";
float temp3 = 0;
float humi3 = 0;
float moist3 = 0;
float rain3 = 0;
float volt3 = 0;
float amps3 = 0;
uint16_t read_id3 = 0;
uint16_t prev_read_id3 = 0;

String jsonString4 = "None";
String dt4 = "None";
float temp4 = 0;
float humi4 = 0;
float moist4 = 0;
float rain4 = 0;
float volt4 = 0;
float amps4 = 0;
uint16_t read_id4 = 0;
uint16_t prev_read_id4 = 0;

String jsonString6 = "None";
String dt6 = "None";
float temp6 = 0;
float humi6 = 0;
float moist6 = 0;
float rain6 = 0;
float volt6 = 0;
float amps6 = 0;
uint16_t read_id6 = 0;
uint16_t prev_read_id6 = 0;

String jsonString7 = "None";
String dt7 = "None";
float temp7 = 0;
float humi7 = 0;
float moist7 = 0;
float rain7 = 0;
float volt7 = 0;
float amps7 = 0;
uint16_t read_id7 = 0;
uint16_t prev_read_id7 = 0;

String jsonString8 = "None";
String dt8 = "None";
float temp8 = 0;
float humi8 = 0;
float moist8 = 0;
float rain8 = 0;
float volt8 = 0;
float amps8 = 0;
uint16_t read_id8 = 0;
uint16_t prev_read_id8 = 0;

#define RGB         18 
#define NUMPIXELS   1 
#define DELAYVAL    100 

#if defined (ESP32DEV_0) || defined (ESP32DEV_1) || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)     
  #define IN1         GROVE_D2
  #define IN2         GROVE_D3
  #define IN3         GROVE_D4
  #define LED_BLUE    GROVE_D5
  #define NUM_LEDS    1
  ChainableLED        leds(GROVE_A0, GROVE_A1, NUM_LEDS); // (LEAVE A1 EMPTY)
  byte                i = 0; // CHAINABLE LED ARRAY
  const int trig_pin = GROVE_D6; // D7 default
  const int echo_pin = GROVE_D7; // D6 default
  #define BLINKER     GROVE_D13
#else
  #define IN1         19
  #define IN2         20
  #define IN3         21
  #define LED_BLUE    26  // assumption IO26 on ESP32S2
  #define NUM_LEDS     1
  ChainableLED        leds(35, 36, NUM_LEDS); // (LEAVE A1 EMPTY) Dummy 35,36 on ESP32S2
  byte                i = 0; // CHAINABLE LED ARRAY
  const int trig_pin = 33; // Dummy 33 on ESP32S2
  const int echo_pin = 34; // Dummy 34 on ESP32S2
  #define BLINKER     37 // Dummy

#endif

#ifdef ESP32C3
  #define ONBOARD_LED 18
  #define R 3
  #define G 4
  #define B 5
#else
  #define ONBOARD_LED 2
#endif

// #include <math.h>


