rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
// Sound speed in air
#define SOUND_SPEED 340
#define TRIG_PULSE_DURATION_US 10
long ultrason_duration;
float distance_cm;
int waterLvlPercent;

const int B = 4275;               // B value of the thermistor
const int R0 = 100000;            // R0 = 100k
#if defined (ESP32DEV_0) || defined (ESP32DEV_1) || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)       
const int pinTempSensor = GROVE_A3;
#else
const int pinTempSensor = 1;     // Grove - Temperature Sensor connect to IO0
#endif


char auth[] = BLYNK_AUTH_TOKEN;

#ifdef LOCATION_MKE2_UiTM_WiFi_IoT
  char ssid[] = "UiTM WiFi IoT";
  char pass[] = ""; // leave this empty as this is an open network
#elif defined LOCATION_MKE2_MaxisONE
  char ssid[] = "MaxisONE Fibre 2.4G";
  char pass[] = "respironics"; 
#elif defined Maxis_Postpaid_128
  char ssid[] = "Maxis Postpaid 128";
  char pass[] = "respironics"; 
#else
  char ssid[] = "MaxisONE Fibre 2.4G_EXT"; 
  char pass[] = "respironics"; // leave this empty as this is an open network
#endif

String ssidstr = "None";
// char ssid[] = "Robotronix MKE2";
// char pass[] = "robotronix"; // leave this empty as this is an open network

// char ssid[] = "Maxis Postpaid 128";
// char pass[] = "respironics"; // leave this empty as this is an open network

#ifdef ESP32C3_4 || defined (ESP32C3_6) || defined (ESP32C3_8)
  #define I2C_SDA                 8 
  #define I2C_SCL                 9
#elif defined ESP32DEV_0 || defined ESP32DEV_1 || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)      
  // use default i2c pinoutx2
#else
  #define I2C_SDA                 41 
  #define I2C_SCL                 40
#endif

#define wifiConnRetryAddress    0x0C // DEC 12 & 13 : 2 bytes 
#define restartCounterAddress   0x0F // DEC 15 & 16 : 2 bytes F 10 11
#define disconnCounterAddress   0x12 // DEC 18 & 19 bytes
#define disconnectTS__Address   0x14 // DEC 20 - 34 (HEX 14 - 22) and beyond 
// ******************************** IFTTT ENTRY STATUS DECLARATION STARTS ********************************
#define entryStatusAddress      0x23 // HEX 0x23 (DEC 35)
#define entryTimestampAddress   0x24 // HEX 0x24 - 32 (DEC 36 - 50) ... 24 25 26 27 28 29 2A 2B 2C 2D 2E 2F 30 31 32
#define elapseAdd               0x33 // HEX 0x33 - 41  (DEC 51 - 65) ... 33 34 35 36 37 38 39 3A 3B 3C 3D 3E 3F 40 41 .. 41 – 33 = E ... 65 – 51 = 14
uint8_t entryState = 0; // 0 exited || 1 entered || 2 keluar || 3 masuk || 4 unknown
String ets = "None";
// ******************************** IFTTT ENTRY STATUS DECLARATION ENDS ********************************
#define ADS_I2C_ADDRESS         0x48

WiFiUDP             ntpUDP;
NTPClient           timeClient(ntpUDP);
BlynkTimer          timer;
Adafruit_NeoPixel   pixels(NUMPIXELS, RGB);
Adafruit_INA219     ina219_A;
ADS1115_WE          adc = ADS1115_WE(ADS_I2C_ADDRESS);
DS1307              _clock;
// comment either one of this
#ifdef REGULAR_I2C_LCD
  LiquidCrystal_I2C   lcd(0x27,16,2);  // set the LCD address to 0x27 for a 16 chars and 2 line display
#else
  rgb_lcd             lcd;
#endif

// Variables to save date and time
String formattedDate;
String dayStamp;
String timeStamp;
String restart_ts = "None";
String disconnected_ts = "None";
String hostname = BLYNK_DEVICE_NAME;
String default_hostname = "None";

float shuntvoltage = -1.0;
float busvoltage = -1.0;
float current_mA = -1.0;

bool I2C_LCD_AVAILABLE = false;
bool GROVE_LCD_AVAILABLE = false; // true for debugging purpose 27.02.2023 | change to false 03.03.2023
bool INA219_AVAILABLE = false;
bool ADS1115_AVAILABLE = false;

#define EEPROM_SIZE             100
#define FAST_DELAY              1000

int restartCounter;      // value will be loaded from EEPROM
int disconnection_count; // value will be loaded from EEPROM
int wifiRetryCount = -1 ; // value will be loaded from EEPROM

byte tick = 0;
byte red, green, blue;

byte degree_symbol[8] = {
    0b00110,
    0b01001,
    0b01001,
    0b00110,
    0b00000,
    0b00000,
    0b00000,
    0b00000,
  };
    byte right_arrow[8] = {
    0b10000,
    0b11000,
    0b11100,
    0b11110,
    0b11111,
    0b11110,
    0b11100,
    0b11000,
  };
    byte wave_right[8] = {
    0b11000,
    0b11100,
    0b01110,
    0b00111,
    0b00111,
    0b01110,
    0b11100,
    0b11000,
  };

  byte wave_left[8] = {
    0b00011,
    0b00111,
    0b01110,
    0b11100,
    0b11100,
    0b01110,
    0b00111,
    0b00011,
  };

BLYNK_CONNECTED();
BLYNK_DISCONNECTED();
BLYNK_RESTART();

BLYNK_WRITE(V20);
BLYNK_WRITE(V21);
BLYNK_WRITE(V22);
BLYNK_WRITE(V23);
BLYNK_WRITE(V24);
BLYNK_WRITE(V25);
BLYNK_WRITE(V26);
BLYNK_WRITE(V27);

double round_2dp(double x); // prototype for func to reduce floating precision
void BLYNK_TASK();
void i2c_scan();
void initINA219();
void init_eeprom();
void off_onboard_led();
void on_onboard_led();
void loopRGB();
void redOn();
void greenOn();
void blueOn();
void rgbOff();
void check_restart_count();

void clear_restartCounter();
void clear_disconnCounter();
void try_wifi_connect(int timeout);

void onRelay1(); // 12V DC solenoid water valve
void onRelay2(); // borrow this function to turn on/off i2c LCD LED backlight 
void onRelay3(); // 12V DC water pump
void offRelay1();
void offRelay2();
void offRelay3();
String get_timestamp();

bool openNetwork = false;

String openWeatherMapApiKey = "dbd7235bcc77e5896c73e975d013debe";
String city = "Kuching";
String countryCode = "MY";
unsigned long lastTime = 0;
unsigned long interval = 60000;

String jsonBuffer   = "None";
String jsonString   = "None";
String jsonHumid    = "None";
String jsonWeather  = "None";

float tempK ; 
float tempC ;
float humid ; 

String mac_str = "UNKNOWN MAC";
String esp_model = "UNKNOWN ESP";

void setup()
{
  Serial.begin(115200);
  #if defined (ESP32DEV_0) || defined (ESP32DEV_1) || defined (ESP32DEV_2) || defined (ESP32DEV_3) || defined (ESP32DEV_4) || defined (ESP32DEV_5) || defined (ESP32DEV_6)      
    Wire.begin();
  #else
    Wire.begin(I2C_SDA, I2C_SCL);
  #endif
  mac_str = WiFi.macAddress();
  const char* mac_addr = mac_str.c_str();
  Serial.print("MAC (String):");
  Serial.println(mac_str);
  Serial.printf("MAC (const char): %s\n", mac_addr);

  //Increment boot number and print it every reboot
  ++bootCount;
  Serial.println("Boot number: " + String(bootCount));
  //Print the wakeup reason for ESP32
  print_wakeup_reason();

