rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
  // WiFi.setHostname(hostname.c_str());
  // Serial.print("ESP32 hostname after changing hostname: ");
  Serial.print("ESP32 hostname after calling setting WiFi_STA: ");
  Serial.println(default_hostname);   /*New Hostname printed*/ 

  ssidstr = String(ssid);
  if(ssidstr.length() > 16)
    ssidstr.remove(0,ssidstr.length()-16); // logic corrected at MKE2 18:58 Wed 21 June

  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    try_wifi_connect(10); // pre-connection using WiFi.begin() with 10 second default timeout
    lcd.clear();
    lcd.setCursor(0,0);
    lcd.print("Connecting WiFi");
    lcd.setCursor(0,1);
    lcd.write(1); // add arrow before SSID
    lcd.print(ssid);
  }

  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.clear();
    lcd.setCursor(0,0);
    lcd.print("Init TimeClient!");
    lcd.setCursor(0,1);
    lcd.print("-Get restart TS!");
  }
  // 30 Dec 2022 Friday | Polished 10 Feb 2023 Friday
  // /Users/zidz/Documents/Arduino/libraries/Blynk/src/Adapters/BlynkArduinoClient.h (to fix connecting to blynk.cloud:80 infinite loop)
  // /Users/zidz/Documents/Arduino/libraries/Blynk/src/Blynk/BlynkProtocol.h (to edit logo)
  // /Users/zidz/Documents/Arduino/libraries/Blynk/src/BlynkSimpleEsp32.h (to edit Blynk.begin method)
  // /Users/zidz/Documents/Arduino/libraries/Blynk/src/Blynk/BlynkHandlers.h (BLYNK define methods)
  Serial.print("ESP32 NEW HOSTNAME: ");
  Serial.println(default_hostname);   /*New Hostname printed*/ 
  
  timeClient.begin();
  timeClient.setTimeOffset(28800);
  restart_ts = get_timestamp(); // must be called after timeClient.begin() for the restart timestamp
  restart_ts = get_timestamp(); // second call to reconfirm

  byte setH=0,setM=0,setS=0;
  short int setYear=2023; 
  byte setMonth=1, setDay=1;

  setH = timeClient.getHours();
  setM = timeClient.getMinutes();
  setS = timeClient.getSeconds();

  formattedDate   = timeClient.getFormattedDate(); 
  int splitT      = formattedDate.indexOf("T");
  String date_only = formattedDate.substring(4, splitT);
  Serial.println(date_only);


  _clock.begin();
  _clock.fillByYMD(setYear,setMonth,setDay);
  _clock.fillByHMS(setH,setM,setS);
  _clock.fillDayOfWeek(WED);
  _clock.setTime(); // write time and date to the RTC chip

  // disable this for IFTTT code
  // Blynk.begin(auth, ssid, pass); // connectWiFi in Blynk is active. meaning connecting twice

  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.clear();
    lcd.setCursor(0,0);
    lcd.print("IFTTT Connected!");
    lcd.setCursor(0,1);
    lcd.print("-"+String(BLYNK_DEVICE_NAME)+" INIT-");
  }
  on_onboard_led();
  pixels.begin(); 
  loopRGB();
  rgbOff();
 

  // xTaskCreatePinnedToCore(
  //     BLYNK_HandlerTask,        /* Task function. */
  //     "BLYNK",                  /* name of task. */
  //     10000,                    /* Stack size of task */
  //     NULL,                     /* parameter of the task */
  //     1,                        /* priority of the task */
  //     &Task2,                   /* Task handle to keep track of created task */
      
  //     CORE_0);                  /* pin task to core 0 */     
  // delay(500); 

  // xTaskCreatePinnedToCore(
  //     ESPNOW_HandlerTask,       /* Task function. */
  //     "ESPNOW",                 /* name of task. */
  //     10000,                    /* Stack size of task */
  //     NULL,                     /* parameter of the task */
  //     1,                        /* priority of the task */
  //     &Task1,                   /* Task handle to keep track of created task */
  //     CORE_1);                  /* pin task to core 1 */                  
  // delay(500); 

  mqtt.subscribe(&ESP32S2_RGB_SW);
  mqtt.subscribe(&locationTracker); // added 8 Nov 2023 Wednesday

  // Set Adafruit IO's root CA
  client.setCACert(adafruitio_root_ca);

} // end of setup


// void loop()
// {
//   // Blynk.run();
//   // timer.run();
// }

uint32_t count=0;
uint8_t x = 0;
const char* pubStr = "ESP recv ";

void loop() {
  // Ensure the connection to the MQTT server is alive (this will make the first
  // connection and automatically reconnect when disconnected).  See the MQTT_connect
  // function definition further below.
  MQTT_connect();

  // // Now we can publish stuff!
  // Serial.print(F("\nSending val "));
  // Serial.print(x);
  // Serial.print(F(" to pubTracker feed..."));
  // if (! pubTracker.publish(x++)) {
  //   Serial.println(F("Failed"));
  // } else {
  //   Serial.println(F("OK!"));
  // }
  // delay(5000);

  Adafruit_MQTT_Subscribe *subscription;
  while ((subscription = mqtt.readSubscription(1000))) { // timeout here is also acting like delay interval for the entire code
    if (subscription == &ESP32S2_RGB_SW) {
      Serial.print(F("\n[ResetFeed] ESP32S2_RGB_SW Got: "));
      Serial.println((char *)ESP32S2_RGB_SW.lastread);
      if (!strcmp((char*) ESP32S2_RGB_SW.lastread, "1")){
        rgbOff();
        if (! pubTracker.publish("Restarting ESP32")) {
          Serial.println(F("Failed"));
        } else {
          Serial.println(F("OK! Restart now"));
          lcd.setCursor(0, 0); // row 1, column 0
          lcd.print("Request Restart"); // default_hostname
          lcd.setCursor(0, 1); // row 1, column 0
          lcd.print("Bye-bye.......");
          disconnected_ts = get_timestamp();
          writeStringToEEPROM(disconnectTS__Address, disconnected_ts);
          delay(1000);
          ESP.restart();
        }
      }

      // if (!strcmp((char*) ESP32S2_RGB_SW.lastread, "ON") || !strcmp((char*) ESP32S2_RGB_SW.lastread, "TOGGLE"))
      // {
      //   count++;
      //   Serial.print("count=");
      //   Serial.println(count);
      // }
      // if(count % 2 == 0)
      //   redOn();
      // else
      //   rgbOff();
  
    } // end of ESP32S2_RGB_SW

    // locationTracker added 8 Nov 2023 Wednesday
    // 0 exited || 1 entered || 2 keluar || 3 masuk || 4 unknown
    if(subscription == &locationTracker){
      Serial.print(F("\nGPS Tracker Got: "));
      // Serial.println((char *)locationTracker.lastread);     
      entryStatus = (char *)locationTracker.lastread; // added 17 Nov 2023 after 99 weirdness in gps detection

      if(!strcmp(entryStatus.c_str(), "masuk")){
        entryStatus = "MASUK";
        entryState = 3;
        greenOn();
        // if (! pubTracker.publish("Sent ESP32 received masuk (switch)")) {
        //   Serial.println(F("Failed"));
        // } else {
        //   Serial.println(F("OK! Sent ESP32 received masuk (switch)"));
        // }
      }
      else if(!strcmp(entryStatus.c_str(), "keluar")){
        entryStatus = "KELUAR";
        entryState = 2;
        redOn();
        // if (! pubTracker.publish("Sent ESP32 received keluar (switch)")) {
        //   Serial.println(F("Failed"));
        // } else {
        //   Serial.println(F("OK! Sent ESP32 received keluar (switch)"));
        // }
      }
      else{
        // entryStatus = (char *)locationTracker.lastread; // added 19 Nov 2023
         if(!strcmp(entryStatus.c_str(), "exited")) {
            entryStatus = "GPSexited";
            entryState = 0;
            redOn(); 
          }
          if(!strcmp(entryStatus.c_str(), "entered")) {
            entryStatus = "GPSentered";
            entryState = 1;
            blueOn();
          }
          // Serial.println(F("[locationTracker] checking completed")); // discovered whitespace 19 Nov

        // if (! pubTracker.publish("####[pubTracker] ESP32 received lastread in ELSE block ####")) {
        //   Serial.println(F("Failed"));
        // } else {
        //   Serial.println(F("####[pubTracker] SUCCESS! ESP32 received lastread in ELSE block ####"));
        // } // end of else
      } // end of if..else (biggest block)
      
      ets = get_timestamp();

      Serial.println("EEPROM write started");
      EEPROM.write(entryStatusAddress, entryState);
      writeStringToEEPROM(entryTimestampAddress, ets);

