rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
      /*
      // this method was discovered on 15 Nov 2023
      // using char array datatype and itoa method

      char cstr[10];
      itoa(entryState, cstr, 10);
      String responseStr = "ESP32 ack response | entryState = ";
      responseStr.concat(cstr);
      Serial.print("cstr:");
      Serial.println(cstr);
      */
      
      String responseStr = "ESP32 ACK | entryState = ";
      responseStr.concat(String(entryState));
      responseStr.concat(" | ");   
      responseStr.concat(entryStatus);   
      const char* eeprom_ack_str = responseStr.c_str();

      // Serial.print("eeprom_ack_str:");
      // Serial.println(eeprom_ack_str);

      if (! pubTracker.publish(eeprom_ack_str)) {
          Serial.println(F("Failed"));
      } else {
          Serial.println(F(eeprom_ack_str));
      }
      delay(100);

      responseStr = "Total Elapse for ";
      if(entryState) // this should be the opposite of current state / to reflect the previous state
        responseStr.concat("GPS Exited");
      else
        responseStr.concat("GPS Entered");
      responseStr.concat(" | ");   
      responseStr.concat(e_elapse);   
      eeprom_ack_str = responseStr.c_str();

      // Serial.print("eeprom_ack_str:");
      // Serial.println(eeprom_ack_str);

      if (! pubTracker.publish(eeprom_ack_str)) {
          Serial.println(F("Failed"));
      } else {
          Serial.println(F(eeprom_ack_str));
      }
      delay(100);
      Serial.println("EEPROM write ended");
      // read_eeprom();
    } // end of locationTracker
  } //  end of MQTT read subscription blocking loop

  countElapse(); // called to update entry / exit elapse timer

  lcd.clear();
  if(elapseSec % 2 == 0){
    lcd.setCursor(0, 0); // row 1, column 0
    lcd.print("Last "+ entryStatus); // default_hostname
    lcd.setCursor(0, 1); // row 1, column 0
    lcd.print(ets);
  }
  else{
    // display_uptime_top_row();
    lcd.setCursor(0, 0); // row 1, column 0
    if(entryState == 1 || entryState == 3)
      lcd.print("IN for:"+ e_elapse); // in elapse
    else
      lcd.print("OUTfor:"+ e_elapse); // out elapse

    lcd.setCursor(0, 1); // row 1, column 0
    // lcd.print("Status:"+ entryStatus); // default_hostname
    if(entryState == 1 || entryState == 3)
      lcd.print("SirYazid is here"); 
    else
      lcd.print("SirYazid at home"); 

  }

} // end of void loop for MQTT

void MQTT_connect() {
  int8_t ret;
  // Stop if already connected.
  if (mqtt.connected()) {
    return;
  }

 Serial.print("Connecting to Adafruit IO");

 /*
 -1 = Error connecting to server 
 1 = Wrong protocol 
 2 = ID rejected 
 3 = Server unavailable 
 4 = Bad username or password 
 5 = Not authenticated 
 6 = Failed to subscribe 
 Use connectErrorString() to get a printable string version of the error.
 
 */

  uint8_t retries = 5;
  while ((ret = mqtt.connect()) != 0) { // connect will return 0 for connected
       Serial.println(mqtt.connectErrorString(ret));
       lcd.clear();
        lcd.setCursor(0, 0); // row 1, column 0
        lcd.print("AdafruitIO Try "+String(retries)); // default_hostname
        lcd.setCursor(0, 1); // row 1, column 0
        // lcd.print("-Not Authorized-");
        lcd.print(mqtt.connectErrorString(ret));


       Serial.println("Retrying Adafruit connection in 1 seconds...");
       mqtt.disconnect();
       delay(1000);  
       retries--;
       if (retries == 0) {
        //  while (1);
        Serial.println("Giving up MQTT...restarting now");
        lcd.clear();
        lcd.setCursor(0, 0); // row 1, column 0
        lcd.print("Adafruit IO Conn"); // default_hostname
        lcd.setCursor(0, 1); // row 1, column 0
        lcd.print("-Restarting ESP-");

        delay(1000);
        ESP.restart();
       }
  }
  Serial.println("");
  Serial.println("MQTT Connected!");
  Serial.println("****************** Adafruit IO is Connected! ****************** ");
}


// callback when data is sent
void OnDataSent(const uint8_t *mac_addr, esp_now_send_status_t status) {
  Serial.print("\r\nLast Packet Send Status:\t");
  Serial.println(status == ESP_NOW_SEND_SUCCESS ? "Delivery Success" : "Delivery Fail");
}


// callback function that will be executed when data is received
void OnDataRecv(const uint8_t * mac_addr, const uint8_t *incomingData, int len) { 

  // Copies the sender mac address to a string
  char macStr[18];
  Serial.print("Packet received from: ");
  snprintf(macStr, sizeof(macStr), "%02x:%02x:%02x:%02x:%02x:%02x",
           mac_addr[0], mac_addr[1], mac_addr[2], mac_addr[3], mac_addr[4], mac_addr[5]);
  // Serial.println(macStr); // UNCOMMENT THIS TO FIGURE OUT THE CLIENT'S MAC 27.08.2022
  if(strcmp(macStr, client1_cchar) == 0)      
  {
    Serial.println("Client ID 1");
  }
  if(strcmp(macStr, client2_cchar) == 0) 
  {
    Serial.println("Client ID 2");
  }
  if(strcmp(macStr, client3_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-3");
  }
  if(strcmp(macStr, client4_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-4");
  }
  // if(strcmp(macStr, client5_cchar) == 0) 
  // {
  //   Serial.println("Client ESP32C3-5");
  // }
  if(strcmp(macStr, client6_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-6");
  }
  if(strcmp(macStr, client7_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-7");
  }
  if(strcmp(macStr, client8_cchar) == 0) 
  {
    Serial.println("Client ESP32C3-8");
  }
  if(strcmp(macStr, client9_cchar) == 0) 
  {
    Serial.println("Client ESP32S2m1");
  }
  // Serial.println("Unknown Client! Check client's MAC");


  memcpy(&incomingReadings, incomingData, sizeof(incomingReadings));

  // float v_2dpf = round_2dp(incomingReadings.volt);
  // float i_2dpf = round_2dp(incomingReadings.amps);

  String v2dp = String(incomingReadings.volt,2);
  String i2dp = String(incomingReadings.amps,2);
  float v_2dpf = v2dp.toFloat();
  float i_2dpf = i2dp.toFloat();
  // must use double quote for the json label 27.08.2022
  board["d"] = incomingReadings.id; 
  board["#"] = String(incomingReadings.readingId);
  board["v"] = v_2dpf; 
  board["a"] = i_2dpf;  
  board["t"] = incomingReadings.temp; 
  board["h"] = incomingReadings.humi; 
  board["m"] = incomingReadings.mois; 
  board["r"] = incomingReadings.rain; 


