rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
  // Add peer CLIENT ID 3       
  if (esp_now_add_peer(&peerInfo3) != ESP_OK){
    Serial.println("Failed to add peer client ID 3");
    return;
  }

  // Register peer (peer here is going to be client-4) CLIENT ID 4
  esp_now_peer_info_t peerInfo4;
  memset(&peerInfo4, 0, sizeof(peerInfo4)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo4.peer_addr, client4_mac, 6);
  peerInfo4.encrypt = false;
  
  // Add peer CLIENT ID 3       
  if (esp_now_add_peer(&peerInfo4) != ESP_OK){
    Serial.println("Failed to add peer client ID 4 (ESP32C3-4)");
    return;
  }

    // Register peer (peer here is going to be client-4) CLIENT ID 4
  esp_now_peer_info_t peerInfo6;
  memset(&peerInfo6, 0, sizeof(peerInfo6)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo6.peer_addr, client6_mac, 6);
  peerInfo6.encrypt = false;
  
  // Add peer CLIENT ID 3       
  if (esp_now_add_peer(&peerInfo6) != ESP_OK){
    Serial.println("Failed to add peer client ID 6 (ESP32C3-6)");
    return;
  }

  // Register peer (peer here is going to be client-8) CLIENT ID 8
  esp_now_peer_info_t peerInfo8;
  memset(&peerInfo8, 0, sizeof(peerInfo8)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo8.peer_addr, client8_mac, 6);
  peerInfo8.encrypt = false;
  
  // Add peer CLIENT ID 3       
  if (esp_now_add_peer(&peerInfo8) != ESP_OK){
    Serial.println("Failed to add peer client ID 8 (ESP32C3-8)");
    return;
  }

    // Register peer (peer here is going to be client-peerInfo9) CLIENT ID S2m1
  esp_now_peer_info_t peerInfo9;
  memset(&peerInfo9, 0, sizeof(peerInfo9)); // https://github.com/espressif/arduino-esp32/issues/6029
  memcpy(peerInfo9.peer_addr, client9_mac, 6);
  peerInfo9.encrypt = false;
  
  // Add peer S2 Mini 1
  if (esp_now_add_peer(&peerInfo9) != ESP_OK){
    Serial.println("Failed to add peer client ID S2m1 (ESP32S2m1)");
    return;
  }


  // esp_now_peer_num_t 
  // coming from client-side code end ----------------------------------------------------------

  // leave this empty to reserve more CPU resources for other intensive tasks    
  for(;;){} // empty forever loop (no need to do anything inside here otherwise it will cost some CPU time)
} // end of FreeRTOS handler
void BLYNK_HandlerTask(void * pvParameters) 
{

  timer.setInterval(1000L, BLYNK_TASK);
  // timer.setInterval(1000L, get_weather);

  Serial.print("BLYNK_HandlerTask running on core ");
  Serial.println(xPortGetCoreID());
  for(;;){    
    Blynk.run();
    timer.run();
  }
} // end of FreeRTOS handler


void try_wifi_connect(int timeout){
    wifiRetryCount++;
    write16bitIntoEEPROM(wifiConnRetryAddress, wifiRetryCount);

    int init_index_right = 9; // init 8 + 1 offset
    int init_index_left = 6; // init 7 - 1 offset
    int column_index_right = init_index_right; 
    int column_index_left = init_index_left;

    int wl_count = 0;
    int connect_elapse = timeout; // timeout in second unit 

    Serial.printf("\n\nConnecting to %s\n\n", ssidstr);
    if(strcmp(pass,"")==0){
      Serial.println("This is an open network!");
      openNetwork = true;
    }else{
      Serial.println("This is a close network!");
      openNetwork = false;
    }
    WiFi.begin(ssid, pass); // normal connect method
    lcd.setCursor(0, 0); // row 1, column 0
    lcd.print("Conn Retry:" +String(wifiRetryCount));  
    while (WiFi.status() != WL_CONNECTED) {
          tick++;
          Serial.printf("/");
          lcd.setCursor(column_index_right, 1);
          lcd.write(1);
          column_index_right++;

          lcd.setCursor(init_index_left+1, 1);
          lcd.print("T");
          lcd.setCursor(init_index_left+2, 1);
          lcd.print(String(wl_count/10));

          lcd.setCursor(column_index_left, 1);
          lcd.write(2);
          column_index_left--;

          if(column_index_right>16 && column_index_left<0) {
            #ifdef USE_RGB_LED
              #ifndef AASAS_TPLINK
              rgbOff();
              #endif
            #endif
            column_index_right  = init_index_right; 
            column_index_left   = init_index_left;
            lcd.clear();
            if(millis()/1000 % 2 == 0){
                lcd.setCursor(0, 0); // row 1, column 0
                lcd.print("Conn Retry:" +String(wifiRetryCount));  
                lcd.setCursor(0, 1); // row 1, column 0
                lcd.print(ssidstr); // default_hostname
                delay(1000);
                off_onboard_led();

            }
            else if(millis()/1000 % 3 == 0 || millis()/1000 % 5 == 0){
                lcd.clear();
                lcd.setCursor(0, 0); // row 1, column 0
                lcd.print("Connecting WiFi");
                lcd.setCursor(0, 1); // row 1, column 0
                if(openNetwork) lcd.print("    Open Network");  
                else            lcd.print("   Close Network");  
                delay(1000);
            }
            else{
                lcd.setCursor(0, 0); // row 1, column 0
                lcd.print(ssidstr);
                on_onboard_led();
            }
          }

      wl_count++;
      delay(100);
      // vTaskDelay(100 / portTICK_PERIOD_MS);
      
      if(wl_count > connect_elapse*10 && (WiFi.status() != WL_CONNECTED)){
          Serial.println("\n\n [ESP32_AASAS_UiTM_WiFi_IoT] Cant join network within timeout. Restarting...");
          wl_count = 0;
          lcd.clear();
          lcd.setCursor(0, 0); // row 1, column 0
          lcd.print("Not Connected!");
          lcd.setCursor(0, 1); // row 1, column 0
          lcd.print("Restarting ESP32");
          delay(1000);
          ESP.restart();
      }
    }

    if(WiFi.status() == WL_CONNECTED){
      Serial.println("WiFi Connected!");
      Serial.println("Syncing RTC via NTP now...");
      timeClient.begin();
      timeClient.setTimeOffset(28800);
      timeClient.update();
      sync_rtc_ntp();
      Serial.println("Syncing RTC via NTP complete. RTC is now up-to-date!");
    }
  
