rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
    if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
      lcd.clear();
      lcd.setCursor(0,0);
      lcd.print("-WiFi Connected-");
      lcd.setCursor(0,1);
      lcd.print(ssidstr);
      delay(1000);
      // vTaskDelay(1000 / portTICK_PERIOD_MS);
    }
}

void get_rtc(){
  _clock.getTime();
  String hour = String(_clock.hour, DEC);  
  String min  = String(_clock.minute, DEC);
  String sec  = String(_clock.second, DEC);

  byte hourByte = hour.toInt();
  byte minByte  = min.toInt();
  byte secByte  = sec.toInt();

  String year = String(_clock.year+2000, DEC);
  String month = String(_clock.month, DEC);
  String day = String(_clock.dayOfMonth, DEC);

  int year_int = year.toInt();
  byte monthByte = month.toInt();
  byte dayByte = day.toInt();
  if(year_int < 2023 || year_int > 2050){
    Serial.println("Error. Date is invalid. Restarting now...");
    delay(1000);
    ESP.restart();
  }
  Serial.printf("H_byte:%d M_byte:%d S_byte:%d --- ", hourByte, minByte, secByte);
  Serial.printf("Y_int:%d Mth_byte:%d D_byte:%d\n", year_int, monthByte, dayByte);

}

void sync_rtc_ntp(){
  String formattedDate;
  String dayStamp;
  String timeStamp;
  String lastSyncRTC;

  byte setH=0,setM=0,setS=0;
  short int setYear=2023; 
  byte setMonth=1, setDay=1;

  timeClient.update();
  setH = timeClient.getHours();
  setM = timeClient.getMinutes();
  setS = timeClient.getSeconds();  
  formattedDate   = timeClient.getFormattedDate(); 
  int splitT      = formattedDate.indexOf("T");
  dayStamp        = formattedDate.substring(0, splitT); // default to 4 || 2023-04-17
  setYear         = formattedDate.substring(0,4).toInt();
  setMonth        = formattedDate.substring(5,7).toInt();
  setDay          = formattedDate.substring(8,10).toInt();

  _clock.begin();
  _clock.fillByYMD(setYear,setMonth,setDay);
  _clock.fillByHMS(setH,setM,setS);
  _clock.fillDayOfWeek(setDay);
  _clock.setTime(); // write time and date to the RTC chip
  // Serial.printf("H:%d M:%d S:%d\n", setH, setM, setS);
  // Serial.printf("Year:%d Month:%d Day:%d\n", setYear, setMonth, setDay);
  
}

void countElapse(){
  /////////// Entry or Exit Duration Elapse Counter Starts ///////////
  if(entryState == 1 || entryState == 3){
    elapseExit = 0; // reset elapseExit upon entry
    elapseEntry += 1; // increment elapseEntry
    elapseSec = elapseEntry;
    e_h = elapseEntry / 3600;
    e_m = (elapseEntry % 3600) / 60;
    e_s = elapseEntry % 60;
  } else{
    elapseExit += 1; // increment elapseExit
    elapseEntry = 0; // reset elapseEntry upon exit
    elapseSec = elapseExit;
    e_h = elapseExit / 3600;
    e_m = (elapseExit % 3600) / 60;
    e_s = elapseExit % 60;
  }

  if(e_h < 10)  e_HourStr = "0"+String(e_h);
  else              e_HourStr = String(e_h);
  if(e_m < 10)   e_MinStr = "0"+String(e_m);
  else              e_MinStr = String(e_m);
  if(e_s < 10)   e_SecStr = "0"+String(e_s);
  else              e_SecStr = String(e_s);

  if(e_s == 0){
    e_elapse = e_HourStr +":"+ e_MinStr +":"+ e_SecStr;  
    write16bitIntoEEPROM(elapseAdd, elapseSec);
    // e_elapse = e_HourStr +":"+ e_MinStr +":"+ e_SecStr;  
    // writeStringToEEPROM(elapseAdd,e_elapse);
  }else{
    e_elapse = e_HourStr +":"+ e_MinStr +":"+ e_SecStr;  
  }  
  /////////// Entry or Exit Duration Elapse Counter Ends ///////////

} // end of countElapse for GPSentered and GPSexited


String get_timestamp(){
  timeClient.update();
  // https://github.com/taranais/NTPClient.git
  formattedDate   = timeClient.getFormattedDate(); 
  int currentHour = timeClient.getHours();
  int currentMin = timeClient.getMinutes();
  int currentsec = timeClient.getSeconds();
  int splitT      = formattedDate.indexOf("T");
  dayStamp        = formattedDate.substring(5, splitT);
  String dateTime = timeClient.getFormattedTime() + " " + dayStamp;

  bool pushAlready = false;

  if(deep_sleep_activated){
    pushAlready = false; // reset this logic
    etaHour = setSleepHour - currentHour;
    etaMin = 60 - currentMin;
    etaSec = 60 - currentsec;
    String etaHourStr, etaMinStr, etaSecStr;
    if(etaHour < 10)  etaHourStr = "0"+String(etaHour);
    else              etaHourStr = String(etaHour);
    if(etaMin < 10)   etaMinStr = "0"+String(etaMin);
    else              etaMinStr = String(etaMin);
    if(etaSec < 10)   etaSecStr = "0"+String(etaSec);
    else              etaSecStr = String(etaSec);

    etaDS = etaHourStr +":"+ etaMinStr +":"+ etaSecStr;  
    int onlineHour = currentHour + SLEEP_HOUR - 24; // calc reconnection time

    String onHour, onMin;
    if(onlineHour < 10) onHour = "0"+String(onlineHour);
    else                onHour = String(onlineHour);      
    if(currentMin < 10) onMin = "0"+String(currentMin);
    else                onMin = String(currentMin);

    Blynk.virtualWrite(V3, "DS starts in T-"+ etaDS);
    // if currentHour similar to WAKEUP_HOUR, then skip the logic
    if((currentHour >= setSleepHour && currentMin >= setSleepMin) || (currentHour >= 0 && currentHour < WAKEUP_HOUR)){
      Serial.println("Going to sleep now. Pushing Deep Sleep Timestamp of " + dateTime);
      Serial.println("Will be back online at " + String(onlineHour) + ":" + String(currentMin));
      Blynk.virtualWrite(V3, "DS started at "+ dateTime);
      delay(1000);
      Blynk.virtualWrite(V3, "Back online at " + (onHour) + ":" + (onMin));
      Serial.flush(); 
      lcd.clear();
      lcd.setCursor(0, 0); // row 0, column 0
      lcd.print("-Back Online at:");
      lcd.setCursor(0, 1); // row 0, column 0
      lcd.print(onHour+ ":" + onMin + " V:" + String(busvoltage));
      delay(1000);
      #ifdef REGULAR_I2C_LCD
        lcd.noBacklight();
      #else
        offRelay2();
      #endif
      leds.setColorRGB(i, 0, 0, 0); // turn off RGB
      delay(1000);
      esp_deep_sleep_start(); // go to sleep and wake up when timer timeout
    }
  }else{
    if(!pushAlready){
      Blynk.virtualWrite(V3, restart_ts); 
      pushAlready = true;
    }
  }
  return dateTime;
} // end of get_timestamp()


