rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
void clear_eeprom(){
  for (int i = 0; i < EEPROM_SIZE; i++)
  {
    EEPROM.write(i, 255);
  }
  Serial.println("[EEPROM REFORMATTED]");
}

void read_eeprom(){

  Serial.println(" [READ AGAIN] bytes read from Flash:");
  for (int i = 0; i < EEPROM_SIZE; i++)
  {
    if(i >= 20 && i <= 34){
      Serial.print("[+][IFTTT] Disconnected Timestamp String Memory "); 
      Serial.print(i); Serial.print(" = ");
      Serial.print(i,HEX); Serial.print(" ASCII DEC:");
    }

  // #define entryStatusAddress      0x23 // HEX 0x23 (DEC 35)
  // #define entryTimestampAddress   0x24 // HEX 0x24 (DEC 36 - 50)

    if(i == 35){
      Serial.print("[+][IFTTT] entryState code at location "); 
      Serial.print(i); Serial.print(" = ");
      Serial.print(i,HEX); Serial.print(" ASCII DEC:");
    }

    if(i >= 36 && i <= 50){ // 0x31 until 0x3F
      Serial.print("[+] entryTimestamp at location "); 
      Serial.print(i); Serial.print(" = ");
      Serial.print(i,HEX); Serial.print(" ASCII DEC:");
    }
    if(i>50){
      Serial.print("[+][IFTTT] Unallocated location "); 
      Serial.print(i); Serial.print(" = ");
      Serial.print(i,HEX); Serial.print(" ASCII DEC:");
    }
    // else if(i== 12 || i==13){
    //     Serial.print("WiFi Retry Count Memory "); Serial.print(i);   Serial.print(":");
    // }
    // else if(i== 15 || i==16){
    //     Serial.print("Restart Count Memory "); Serial.print(i);   Serial.print(":");
    // }else if (i== 18 || i==19){
    //     Serial.print("Disconnection Count Memory "); Serial.print(i);   Serial.print(":");
    // }else{
    //     Serial.print("R "); Serial.print(i);   Serial.print(":");
    // }
    Serial.print(byte(EEPROM.read(i))); Serial.println();
  }
  Serial.println();


}

void init_eeprom(){

  if (!EEPROM.begin(EEPROM_SIZE))
  {
    Serial.println("failed to initialise EEPROM"); delay(1000000);
  }

//   Serial.println("[EEPROM] bytes read from Flash:");
//   for (int i = 0; i < EEPROM_SIZE; i++)
//   {
//     if(i >= 20 && i <= 34){
//       Serial.print("[IFTTT] Disconn TS str Mem "); 
//       Serial.print(i); Serial.print(" = ");
//       Serial.print(i,HEX); Serial.print(" ASCII DEC:");
//     }

// // #define entryStatusAddress      0x23 // HEX 0x23 (DEC 35)
// // #define entryTimestampAddress   0x24 // HEX 0x24 (DEC 36 - 50)

//     if(i == 35){
//       Serial.print("[IFTTT] entryState code at location "); 
//       Serial.print(i); Serial.print(" = ");
//       Serial.print(i,HEX); Serial.print(" ASCII DEC:");
//     }

//     if(i >= 36 && i <= 50){ // 0x31 until 0x3F
//       Serial.print("[IFTTT] entryTimestamp at location "); 
//       Serial.print(i); Serial.print(" = ");
//       Serial.print(i,HEX); Serial.print(" ASCII DEC:");
//     }
//     // 15:35:02 11-17 (ascii char) (15 mem blocks including NULL char \0)
//     // 14(shift out) 49 53 58 51 53 58 48 50 32 49 49 45 49 55
//     if(i>50){
//       Serial.print("Unallocated location "); 
//       Serial.print(i); Serial.print(" = ");
//       Serial.print(i,HEX); Serial.print(" ASCII DEC:");
//     }
    
//     // else if(i== 12 || i==13){
//     //     Serial.print("WiFi Retry Count Memory "); Serial.print(i);   Serial.print(":");
//     // }
//     // else if(i== 15 || i==16){
//     //     Serial.print("Restart Count Memory "); Serial.print(i);   Serial.print(":");
//     // }else if (i== 18 || i==19){
//     //     Serial.print("Disconnection Count Memory "); Serial.print(i);   Serial.print(":");
//     // }else{
//     //     Serial.print("R "); Serial.print(i);   Serial.print(":");
//     // }
//     if(byte(EEPROM.read(i))==14) Serial.print("SHIFT OUT:");
//     Serial.print(byte(EEPROM.read(i))); Serial.println();
//   }
//   Serial.println();
}

void initINA219(){
  if (! ina219_A.begin()) {
    Serial.println("Failed to find INA219_A chip");
    lcd.setCursor(0, 0); // row 1, column 0
    lcd.print("INA219_A FAILED!");
    lcd.setCursor(0, 1); // row 1, column 0
    lcd.print("CHECK I2C WIRE");
    while (1) { delay(10); }
  }
  // ina219_A.setCalibration_32V_2A();
  ina219_A.setCalibration_16V_400mA();
}

float prev_mA = -1;
bool sampleTaken = false;
void getINA219(){
  shuntvoltage = ina219_A.getShuntVoltage_mV(); // measured across Vin+ & Vin-
  busvoltage = ina219_A.getBusVoltage_V(); // measured at Vin+ only
  current_mA = ina219_A.getCurrent_mA();
  if(!sampleTaken){
    prev_mA = current_mA;
    sampleTaken = true;
  }
  // to ensure the current_mA is only within +/- 50mA to be seen as valid value (no big jump)
  if((current_mA > prev_mA-50) && (current_mA < prev_mA+50)){
    prev_mA = current_mA;
  }else{
    current_mA = prev_mA; // use the prev readout if the jump in value is too big (glitches)
  }
}

void i2c_scan() {
  byte error, address, nDevices = 0;
  Serial.println("Scanning...");
  // Wire.setClock(125000); // discovered 27.02.2023 at Berlian | disabled 3.03.2023 Friday MKE2 (issue fixed)
  for(address = 1; address < 127; address++ ) {
    Wire.beginTransmission(address);
    delay(1); // re-enabled 3.03.2023 Friday MKE2 (issue fixed) | kind of fixing the slow scanning issue 03.03.2023
    error = Wire.endTransmission();
    // Serial.printf("Address: 0x%02x \t Error: %d\n", address, error); // added 27.02.2023 at Berlian

    if (error == 0) {
    //   Serial.print("------------------------------- I2C device found at address 0x");
    //   if (address<16) {
    //     Serial.print("0");
    //   }
    //   Serial.println(address,HEX);
      if(address == 0x27) I2C_LCD_AVAILABLE = true;
      if(address == 0x3E) GROVE_LCD_AVAILABLE = true;
      if(address == 0x40) INA219_AVAILABLE    = true;
      if(address == 0x48) ADS1115_AVAILABLE   = true;
      nDevices++;
    }
    else if (error==4) {
      Serial.print("Unknow error at address 0x");
      if (address<16) {
        Serial.print("0");
      }
      Serial.println(address,HEX);
    }    
  }
  if (nDevices == 0) {
    Serial.println("No I2C devices found\n");
  }
  else {
    Serial.println("done\n");
  }
  // Wire.endTransmission(false); // added 03.03.2023 Friday MKE2 (issue fixed)
}

