rtxsc/esp-workspace/ESP32_IFTTT_UiTM_WiFi_IoT/ESP32_IFTTT_UiTM_WiFi_IoT.ino
void display_uptime_top_row(){
    uptime_formatter::getUptime();
    lcd.setCursor(0, 0); // row 0, column 0
    lcd.print("U");
    if(int(uptime::getDays())<10)
    {lcd.print("00");
    lcd.print(uptime::getDays());}
    else if(int(uptime::getDays())<100)
    {lcd.print("0");
    lcd.print(uptime::getDays());}
    else
    lcd.print(uptime::getDays());

    lcd.print("d ");
    lcd.setCursor(6, 0);
    if(int(uptime::getHours())<10){
      lcd.print("0");
      lcd.print(uptime::getHours());
    }
    else
      lcd.print(uptime::getHours());
      lcd.print("h ");
      lcd.setCursor(10, 0);
      if(int(uptime::getMinutes())<10){
        lcd.print("0");
        lcd.print(uptime::getMinutes());
      }
    else
      lcd.print(uptime::getMinutes());
    lcd.print("m ");
    lcd.setCursor(14, 0);
    lcd.print(uptime::getSeconds());
    lcd.print("s");
    
  }

String get_rssi_state(int rssi){
  String out;
  if(rssi > -30) out = "Perfect signal";
  else if(rssi > -50) out = "Excellent signal";
  else if(rssi > -60) out = "Good reliable signal";
  else if(rssi > -67) out = "Voice and Non-HD vid";
  else if(rssi > -70) out = "Light browsing and email";
  else if(rssi > -80) out = "Unstable connection";
  else                out = "Unlikely connection";
  return out;
}

void get_weather(){
    String serverPath = "http://api.openweathermap.org/data/2.5/weather?q=" + city + "," + countryCode + "&APPID=" + openWeatherMapApiKey;
    
    jsonBuffer = httpGETRequest(serverPath.c_str());
    #ifdef DEBUG_SERIAL
    // Serial.println(jsonBuffer); // print all JSON output
    #endif
    JSONVar myObject = JSON.parse(jsonBuffer);

    // JSON.typeof(jsonVar) can be used to get the type of the var
    if (JSON.typeof(myObject) == "undefined") {
      #ifdef DEBUG_SERIAL
      Serial.println("Parsing input failed!");
      #endif
      return;
    }

    // 0K − 273.15

    jsonString = JSON.stringify(myObject["main"]["temp"]);
    jsonHumid = JSON.stringify(myObject["main"]["humidity"]);

    tempK = jsonString.toFloat(); 
    tempC = tempK - 273.15;
    humid = jsonHumid.toFloat(); 

    jsonWeather = JSON.stringify(myObject["weather"][0]["description"]);
    // String jsonWeather = "thunderstorm with light rain";

    #ifdef DEBUG_SERIAL
    Serial.print("JSON object = ");
    Serial.println(myObject);
    Serial.print("Temperature: ");
    Serial.println(tempC);
    Serial.print("Pressure: ");
    Serial.println(myObject["main"]["pressure"]);
    Serial.print("Humidity: ");
    Serial.println(myObject["main"]["humidity"]);
    Serial.print("Wind Speed: ");
    Serial.println(myObject["wind"]["speed"]);
    Serial.print("Weather: ");
    Serial.println(myObject["weather"][0]["description"]);
    Serial.print("Feels like: ");
    Serial.println(myObject["main"]["feels_like"]);
    #endif
}

String httpGETRequest(const char* serverName) {
  WiFiClient client;
  HTTPClient http;
    
  // Your Domain name with URL path or IP address with path
  http.begin(client, serverName);
  
  // Send HTTP POST request
  int httpResponseCode = http.GET();
  
  String payload = "{}"; 
  
  if (httpResponseCode>0) {
    #ifdef DEBUG_SERIAL
    Serial.print("HTTP Response code: ");
    Serial.println(httpResponseCode);
    #endif
    payload = http.getString();
  }
  else {
    #ifdef DEBUG_SERIAL
    Serial.print("Error code: ");
    Serial.println(httpResponseCode);
    #endif

  }
  // Free resources
  http.end();

  return payload;
}


void read_ads1115(){
  float ch0 = readChannel(ADS1115_COMP_0_GND);   // turbidity sensor   
  float ch1 = readChannel(ADS1115_COMP_1_GND);   // V16 takeover from GPS char count
  float ch2 = readChannel(ADS1115_COMP_2_GND);   // V41 takeover from GPS fix age
  float ch3 = readChannel(ADS1115_COMP_3_GND);   // V27 takeover from Sat in Use
  String ads_readout = "ch0: "+ String(ch0)+" mV ch1: "+ String(ch1,0)+" mV ch2: "+ String(ch2)+" mV ch3: "+ String(ch3)+" mV";
  Blynk.virtualWrite(V18, ads_readout);
}

float readChannel(ADS1115_MUX channel) {
  float voltage = 0.0;
  adc.setCompareChannels(channel);
  adc.startSingleMeasurement();
  while(adc.isBusy()){}
  voltage = adc.getResult_mV(); // alternative: getResult_mV for Millivolt
  return voltage;
}

float get_ambient_temp()
{
    int a = analogRead(pinTempSensor);
    // int scaled = map(a,0,8192,0,1023);
    // float R = 1023.0/scaled-1.0; // 1023 = 1 ... 8192 = 8
    float R = 8191.0/a-8.0; 

    R = R0*R;

    float temperature = 8.0/(log(R/R0)/B+1/298.15)-273.15; // convert to temperature via datasheet
    // Serial.printf("analogRead at pin %d = %d and R value = %f\n", pinTempSensor, a, R);
    // Serial.print("temperature = ");
    // Serial.println(temperature);
    return temperature;
}
  
void BLYNK_TASK(){
    tick++; // to replace tick
    if(INA219_AVAILABLE) getINA219();
    if(ADS1115_AVAILABLE) 
      read_ads1115(); //   Blynk.virtualWrite(V18, ads_readout) happening inside func
    else{
      // Blynk.virtualWrite(V18, "ADS1115 Not Connected"); // before adding sonar SR04-M2
      // Blynk.virtualWrite(V18, "Water Level = " + String(get_water_level_cm())+" cm @ " + String(waterLvlPercent)+"%");   
      Blynk.virtualWrite(V44,get_water_level_cm());
      Blynk.virtualWrite(V43,waterLvlPercent);
      /*
      C3-3 to AASAS M10 (TBS)
      C3-4 to AASAS M03 (MKE)
      C3-8 to AASAS M10 (TBS)
      */
    }
    if(tick % 3 == 0){
      on_onboard_led();
      if(busvoltage >= 13)
        setRGBtoWhite();
      else if(busvoltage >= 12 && busvoltage < 13)
        setRGBtoBlue();
      else if(busvoltage >= 11 && busvoltage < 12)
        setRGBtoGreen();
      else
        setRGBtoRed();
    }
    else{
      off_onboard_led();    
    }
    String dateTime = get_timestamp();
    // Serial.print("Datetime:");
    // Serial.println(dateTime);
    int RSSI_dBm =  WiFi.RSSI();
    setRGB_from_RSSI(RSSI_dBm);
    if(millis() % 2 == 0)
      mapRGBtoRSSI(red, green, blue);
    else
      rgbOff();
    
    Blynk.virtualWrite(V0,uptime_formatter::getUptime());
    Blynk.virtualWrite(V1, dateTime);
    Blynk.virtualWrite(V4, RSSI_dBm);
    Blynk.virtualWrite(V6, busvoltage);
    Blynk.virtualWrite(V7, current_mA); 
    Blynk.virtualWrite(V9, get_rssi_state(RSSI_dBm));
    Blynk.virtualWrite(V10, tempC);
    Blynk.virtualWrite(V11, humid);
    // Blynk.virtualWrite(V12, jsonWeather); // disabled temporarily
    #ifdef ESP32DEV_5
      Blynk.virtualWrite(V12, "S2m1 = " + jsonString3); // ESP32S2m1 taking over ESP32C3-3 (condemned)
      Blynk.virtualWrite(V15, "C3-6 = " + jsonString6); // taking over disconnected TS
    #elif defined ESP32S2_3
      Blynk.virtualWrite(V12, "C3-4 = " + jsonString4); // 
      Blynk.virtualWrite(V15, "C3-7 = " + jsonString7); //
    #else
    #endif    
    Blynk.virtualWrite(V34, get_ambient_temp()); // gonna change this to V30 - 21/6/2023

    if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE)
      lcd.clear();

    if(displayESPNOW){
        if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
          #if defined LOCATION_MKE2_MaxisONE || defined (LOCATION_MKE2_UiTM_WiFi_IoT)
            lcd.setCursor(0,0); // MKE2 
            lcd.print("C3-4 #"+String(read_id4)+" V:" + String(volt4)); // print connected SSID
            lcd.setCursor(0,1);
            lcd.print("C3-7 #"+String(read_id7)+" V:" + String(volt7)); // print connected SSID
          #else
            lcd.setCursor(0,0); // TBS
            lcd.print("C3-6 #"+String(read_id6)+" V:" + String(volt6)); // print connected SSID
            lcd.setCursor(0,1); // MKE2
            lcd.print("S2m1 #"+String(read_id3)+" V:" + String(volt3)); // print connected SSID
          #endif
        }
    }
    else if(deep_sleep_activated){
      if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
        lcd.setCursor(0,0); // row 0, column 0
        lcd.print("DS ETA: "+ etaDS); // print connected SSID
        lcd.setCursor(0,1); // row 0, column 0
        lcd.print(String(busvoltage)+"V I:"+String(current_mA)+"mA");
      }
    }
    else{
       if(millis() % 2 == 0){
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            lcd.setCursor(0,0); // row 0, column 0
            lcd.print("----"+ String(BLYNK_DEVICE_NAME)+"---"); // ----AASAS ONE---
            lcd.setCursor(0,1);
            lcd.print(dateTime);
          }
        }
        else if(millis() % 4 == 0){
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            lcd.setCursor(0,0); // row 0, column 0
            lcd.print(esp_model); // print connected SSID
            lcd.setCursor(0,1); // row 0, column 0
            lcd.print(mac_str); // print connected SSID
          }
        }
        else if(millis() % 6 == 0){
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            lcd.setCursor(0,0); // row 0, column 0
            lcd.print("RSSI: "+String(RSSI_dBm)+" dBm"); // print connected SSID
            lcd.setCursor(0,1); // row 0, column 0
            lcd.print(get_rssi_state(RSSI_dBm)); // print connected SSID
          }
        }
        else if(millis() % 8 == 0){
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            lcd.setCursor(0,0); // row 0, column 0
            lcd.print("DS ETA: "+ etaDS); // print connected SSID
            lcd.setCursor(0,1); // row 0, column 0
            lcd.print(String(busvoltage)+"V I:"+String(current_mA)+"mA");
          }
        }
        else{
          if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
            display_uptime_top_row();
            lcd.setCursor(0,1); // row 0, column 0
            lcd.print(String(busvoltage)+"V I:"+String(current_mA)+"mA");
          }
        }    
    } // close else for espnow display
    rgb_LED_Off();      
}

BLYNK_CONNECTED() {
  blueOn();
  if(GROVE_LCD_AVAILABLE || I2C_LCD_AVAILABLE){
    lcd.clear();
    lcd.setCursor(0,0); // row 0, column 0
    lcd.print("Blynk Connected!"); // print connected SSID
    lcd.setCursor(0,1); // row 0, column 0
    lcd.print("Device is Online"); // print connected SSID
    delay(1000);
  }
  Blynk.virtualWrite(V19, wifiRetryCount);
  wifiRetryCount = 0; // reset this back for the next cycle
  write16bitIntoEEPROM(wifiConnRetryAddress, wifiRetryCount);
  String blynk_on_connected_ts = get_timestamp();
  Blynk.syncVirtual(V20,V21,V22,V23,V24,V25,V26,V40,V41);
  Blynk.virtualWrite(V2, WiFi.localIP().toString());
  Blynk.virtualWrite(V3, restart_ts); 
  Blynk.virtualWrite(V5, restartCounter);
  Blynk.virtualWrite(V8, ssid);
  String disconn_ts_str = readStringFromEEPROM(disconnectTS__Address);
  Serial.print("|||||||||||||||||||||||||||||||||| [IFTTT/Blynk Restart] The disconnection timestamp from EEPROM: ");
  Serial.println(disconn_ts_str);
  if(disconnection_count == 0)
    Blynk.virtualWrite(V15, "Not yet");
  else
    Blynk.virtualWrite(V15, disconn_ts_str);
  disconnection_count = read16bitFromEEPROM(disconnCounterAddress);
  Blynk.virtualWrite(V16, disconnection_count);
  Blynk.virtualWrite(V17, blynk_on_connected_ts); 
  Blynk.virtualWrite(V29, default_hostname); 
}

BLYNK_DISCONNECTED() {
    redOn();
    disconnection_count++;
    write16bitIntoEEPROM(disconnCounterAddress,disconnection_count);
    disconnected_ts = get_timestamp();
    writeStringToEEPROM(disconnectTS__Address, disconnected_ts);
  
